```
echo $AWS_REGION && cat barebone.eu-west-1.yml | yq -e .spec.region && AWS_DEFAULT_REGION=us-east-1 AWS_ACCESS_KEY_ID=$AWS_ACCESS_KEY_ID AWS_SECRET_ACCESS_KEY=$AWS_SECRET_ACCESS_KEY furyctl-ng create cluster -c barebone.eu-west-1.yml --distro-location 'git::git@github.com:sighupio/fury-distribution.git?depth=1&ref=feature/furyctl-next' --phase infrastructure

eu-south-1
INFO Downloading distribution...
INFO Validating configuration file...
INFO Downloading dependencies...
INFO Validating dependencies...
INFO Creating cluster...
INFO Running infrastructure phase...
INFO Creating cloud resources, this could take a while...



```


```hcl
Terraform will perform the following actions:

  # module.vpc-and-vpn.aws_eip.vpn[0] will be created
  + resource "aws_eip" "vpn" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + vpc                  = true
    }

  # module.vpc-and-vpn.aws_eip_association.vpn[0] will be created
  + resource "aws_eip_association" "vpn" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.vpc-and-vpn.aws_iam_access_key.furyagent will be created
  + resource "aws_iam_access_key" "furyagent" {
      + create_date          = (known after apply)
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "eks-barebone-bootstrap"
    }

  # module.vpc-and-vpn.aws_iam_policy.furyagent will be created
  + resource "aws_iam_policy" "furyagent" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "eks-barebone-bootstrap"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
    }

  # module.vpc-and-vpn.aws_iam_policy_attachment.furyagent will be created
  + resource "aws_iam_policy_attachment" "furyagent" {
      + id         = (known after apply)
      + name       = "eks-barebone-bootstrap"
      + policy_arn = (known after apply)
      + users      = [
          + "eks-barebone-bootstrap",
        ]
    }

  # module.vpc-and-vpn.aws_iam_user.furyagent will be created
  + resource "aws_iam_user" "furyagent" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "eks-barebone-bootstrap"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.vpc-and-vpn.aws_instance.vpn[0] will be created
  + resource "aws_instance" "vpn" {
      + ami                          = "ami-0c4f7023847b90238"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = false
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + user_data                    = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # module.vpc-and-vpn.aws_s3_bucket.furyagent will be created
  + resource "aws_s3_bucket" "furyagent" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "eks-barebone-bootstrap-bucket-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.vpc-and-vpn.aws_security_group.vpn will be created
  + resource "aws_security_group" "vpn" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "eks-barebone-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # module.vpc-and-vpn.aws_security_group_rule.vpn will be created
  + resource "aws_security_group_rule" "vpn" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 1194
      + id                       = (known after apply)
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 1194
      + type                     = "ingress"
    }

  # module.vpc-and-vpn.aws_security_group_rule.vpn_egress will be created
  + resource "aws_security_group_rule" "vpn_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.vpc-and-vpn.aws_security_group_rule.vpn_ssh will be created
  + resource "aws_security_group_rule" "vpn_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.vpc-and-vpn.local_file.furyagent will be created
  + resource "local_file" "furyagent" {
      + content              = (sensitive)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./secrets/furyagent.yml"
      + id                   = (known after apply)
    }

  # module.vpc-and-vpn.local_file.sshkeys will be created
  + resource "local_file" "sshkeys" {
      + content              = <<-EOT
            users:
              - name: g-iannelli
                user_id: g-iannelli
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./ssh-users.yml"
      + id                   = (known after apply)
    }

  # module.vpc-and-vpn.null_resource.init will be created
  + resource "null_resource" "init" {
      + id       = (known after apply)
      + triggers = {
          + "init" = "just-once"
        }
    }

  # module.vpc-and-vpn.null_resource.ssh_users will be created
  + resource "null_resource" "ssh_users" {
      + id       = (known after apply)
      + triggers = {
          + "sync-operator" = "sighup"
          + "sync-users"    = "g-iannelli"
        }
    }

  # module.vpc-and-vpn.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                               = "eks-barebone-us-east-1a"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
        }
      + vpc                  = true
    }

  # module.vpc-and-vpn.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"                               = "eks-barebone"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                               = "eks-barebone-us-east-1a"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
        }
    }

  # module.vpc-and-vpn.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc-and-vpn.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc-and-vpn.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                               = "eks-barebone-private"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                               = "eks-barebone-public"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.0.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                               = "eks-barebone-private-us-east-1a"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + tags_all                        = {
          + "Name"                               = "eks-barebone-private-us-east-1a"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.16.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                               = "eks-barebone-private-us-east-1b"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + tags_all                        = {
          + "Name"                               = "eks-barebone-private-us-east-1b"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.32.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                               = "eks-barebone-private-us-east-1c"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + tags_all                        = {
          + "Name"                               = "eks-barebone-private-us-east-1c"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.48.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                               = "eks-barebone-public-us-east-1a"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + tags_all                        = {
          + "Name"                               = "eks-barebone-public-us-east-1a"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.49.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                               = "eks-barebone-public-us-east-1b"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + tags_all                        = {
          + "Name"                               = "eks-barebone-public-us-east-1b"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.50.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                               = "eks-barebone-public-us-east-1c"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + tags_all                        = {
          + "Name"                               = "eks-barebone-public-us-east-1c"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc-and-vpn.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.10.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name"                               = "eks-barebone"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
        }
      + tags_all                         = {
          + "Name"                               = "eks-barebone"
          + "kubernetes.io/cluster/eks-barebone" = "shared"
        }
    }

Plan: 36 to add, 0 to change, 0 to destroy.
```